import 'package:flutter/material.dart';
import 'package:get/get.dart';

class HomeController extends GetxController {
  final count = 0.obs;

  final suras = [].obs;
  final selected = 0.obs;
  @override
  void onInit() {
    //
    //
    //
    //
    super.onInit();
    //
    //
    //
    //
    print(onInit);
    suras.value = duaList;
  }
  //
  //increase button(ELECTRIC TOZBI)

  void increment() {
    count.value++;
  }
  //
  // decrease button(ELECTRIC TOZBI)

  void decrement() {
    count.value--;
  }

  //
  //reset button(ELECTRIC TOZBI)
  void reset() {
    count.value = 0;
  }

  static const List<Color> colors = [
    Colors.red,
    Colors.green,
    Colors.blue,
    Colors.green,
    Colors.purple,
    Colors.deepOrange,
    Colors.grey,
    Colors.indigoAccent,
    Colors.lightBlue,
    Colors.orangeAccent,
    Colors.blueAccent,
    Colors.redAccent,
    Colors.orangeAccent,
  ];
  //
  //The included duas are called on List of Duas ; on ELECTRIC TOZBI page
  static const List<String> duaList = [
    "اَللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا , وَ رِزْقًا طَيَّبًا , وَ عَمَلاً مُتَقَبَّلاً(Allahumma inni as’aluka ‘Ilman naafi’an, wa rizqan tayyiban, wa ‘amalan mutaqabbalan)",
    "اللَّهُمَّ اِنِّىْ اَسْئَلُكَ حُبَّكَ وَ حُبَّ مَنْ يُّحِبُّكَ وحُبَّ عَمَلٍ يُّقَرِّبُ اِلى حُبِّكَ(Allahumma inni as aluka hubbaka, wa hubba man yuhibbuka, wa hubba kulle ‘amalin yuqarribuni ila hubbika.)",
    "اللهم إنك عفو تحب العفو فاعفو عنى(Allahumma innaka `afuwwun, tuhibbul-`afwa, fa`fu `anni)",
    "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ العَلِيمُ(Rabbana taqabbal minna innaka antas Sameeaul Aleem)",
    "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ(Rabbana wa-j'alna Muslimayni laka wa min Dhurriyatina 'Ummatan Muslimatan laka wa 'Arina Manasikana wa tub 'alayna 'innaka 'antat-Tawwabu-Raheem)",
    "رَبَّنَآ اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَّفِي الْاٰخِرَةِ حَسَـنَةً وَّقِنَا عَذَابَ النَّارِ(Rabbanaaa Aatinaa Fiddunyaa H’asanata Wa Fil Aakhirati H’asanata Wa Qinaa A’d’aaban Naar)",
    "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْراً وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى القَوْمِ الكَافِرِينَ(Rabbana afrigh 'alayna sabran wa thabbit aqdamana wansurna 'alal-qawmil-kafirin)",
    "رَبَّنَا لَا تُؤَاخِذْنَآ اِنْ نَّسِيْنَآ اَوْ اَخْطَاْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ اِصْرًا كَمَا حَمَلْتَهٗ عَلَي الَّذِيْنَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهٖ ۚ وَاعْفُ عَنَّا ۪ وَاغْفِرْ لَنَا ۪ وَارْحَمْنَا ۪ اَنْتَ مَوْلٰىنَا فَانْــصُرْنَا عَلَي الْقَوْمِ الْكٰفِرِيْنَ(Rabbanaa Laa Too-Akhid’naaa In-Naseenaa Aw Akht’aanaa Rabbanaa wa Laa Tah’mil A’laynaaa Is’ran Kamaa Ha’maltahoo A’lal Lad’eena min Qablinaa Rabbanaa wa Laa Tuh’ammilnaa Maa Laa T’aaqata Lanaa Bih Wa’-Fu A’nnaa Waghfirlanaa Warh’amnaa Anta Mawlaanaa Fans’urnaa A’lal Qawmil Kaafireen)",
    "رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ ھَدَيْتَنَا وَھَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً ۚ اِنَّكَ اَنْتَ الْوَھَّابُ(Rabbanaa Laa Tuzigh Quloobanaa Ba’-Da Id’hadaytanaa Wa Hab Lanaa Mil Ladunka Rah’mah Innaka Antal Wahaab)",
    "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لاَّ رَيْبَ فِيهِ إِنَّ اللّهَ لاَ يُخْلِفُ الْمِيعَادَ(Rabbana innaka jami'unnasi li-Yawmil la rayba fi innAllaha la yukhliful mi'aad)",
    "رَبَّنَآ اِنَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ(Rabbana innana amanna faghfir lana dhunuubana wa qinna 'adhaban-Naar)",
    "رَبَّنَا آمَنَّا بِمَا أَنزَلَتْ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَِ(Rabbana amanna bima anzalta wattaba 'nar-Rusula fak-tubna ma'ash-Shahideen)",
    "رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَ اِسْرَافَنَا فِيْٓ اَمْرِنَا وَثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَي الْقَوْمِ الْكٰفِرِيْنَ(Rabbanaghfir lanaa d’unoobanaa wa israafanaa fee amrinaa wa thabbit aqdaamanaa wan s’urnaa a’lal qawmil kaafireen)",
    "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ(Rabbana aamana faktubna ma' ash-shahideen)",
    "رَبَّنَا أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ السَّمَاء تَكُونُ لَنَا عِيداً لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ(Rabbana anzil 'alayna ma'idatam minas-Samai tuknu lana 'idal li-awwa-lina wa aakhirna wa ayatam-minka war-zuqna wa anta Khayrul-Raziqeen)",
    "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ(Rabbana zalamna anfusina wa il lam taghfir lana wa tarhamna lana kunan minal-khasireen)",
    "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ(Rabbanaa Laa Taj-a’lnaa Ma – A’l Qawmiz’ Z’aalimeen)",
    "رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ(Rabbanaf-tah baynana wa bayna qawmina bil haqqi wa anta Khayrul Fatiheen)",
    "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ(Rabbana afrigh 'alayna sabraw wa tawaffana Muslimeen)",
    "رَبِّ اجْعَلْنِيْ مُقِيْمَ الصَّلٰوةِ وَمِنْ ذُرِّيَّتِيْ رَبَّنَا وَتَقَبَّلْ دُعَاۗءِ(Rabbij-A’lnee Muqeemas’ S’alaati Wa Min D’urrriyyatee Rabbanaa Wa Taqabbal Du-A’aa)",
  ];

  //
  //ALLAH NAMES are called on AllahNames Page
  static const List<String> allahnames = [
    "আর রাহমান(الرحمن) – পরম দয়ালু",
    "আর রহিম(الرحيم) – অতিশয় মেহেরবান",
    "আল মালিক(الملك) – সর্বকর্তৃত্বময়",
    "আল কুদ্দুস(القدوس) – অতি পবিত্র",
    "আস সালাম(السلام) – শান্তি দানকারী",
    "আল মুমিন(المؤمن) – নিরাপত্তা ও ঈমান দানকারী",
    "আল মুহাইমিন(المهيمن) – পরিপূর্ণ রক্ষণাবেক্ষণকারী",
    "আল আজিজ(العزيز) – পরাক্রমশালী",
    "আল জাব্বার(الجبار) – দুর্নিবার",
    "আল মুতাকাব্বির(المتكبر) – নিরঙ্কুশ শ্রেষ্ঠত্বের অধিকারী",
    "আল খালিক(الخالق) – সৃষ্টিকর্তা",
    "আল বারী(البارئ) – সঠিকভাবে সৃষ্টিকারী",
    "আল মুসাউইর(المصور) – আকৃতি দানকারী",
    "আল গাফ্ফার(الغفار) – পরম ক্ষমাশীল",
    "আল ক্বাহার(القهار) – কঠোর",
    "আল ওয়াহ্হাব(الوهاب) – সবকিছু দানকারী",
    "আর রাজ্জাক(الرزاق) – রিযিকদাতা",
    "আল ফাত্তাহ(الفتاح) – বিজয়দানকারী",
    "আল আলীম(العليم) – সর্বজ্ঞ",
    "আল কাবিদ্ব(القابض) – সংকীর্ণকারী",
    "আল বাসিত(الباسط) – প্রশস্তকারী",
    "আল খাফিদ(الخافض) – অবনতকারী",
    "আর রাফী(الرافع) – উন্নতকারী",
    "আল মুজিব(المعز) – সম্মান দানকারী",
    "আল মুদ্বিল্ল(المذل) – (অবিশ্বাসীদের) বেইজ্জতকারী",
    "আস সামি(السميع) – সর্বশ্রোতা",
    "আল বাসীর(البصير) – সর্ববিষয় দর্শনকারী",
    "আল হাকাম(الحكم) – অতল বিচারক",
    "আল আদল(العدل) – পরিপূর্ণ ন্যায়বিচারক",
    "আল লতিফ(اللطيف) – সকল গোপন বিষয়ে অবগত",
    "আল খাবির(الخبير) – সকল বিষয়ে জ্ঞাত",
    "আল হালিম(الحليم) – অত্যন্ত ধর্য্যশীল",
    "আল আজিম(العظيم) – সর্বত্ত মর্যাদাশীল",
    "আল গফুর(الغفور) – পরম ক্ষমাশীল",
    "আস শাকুর(الشكور) – গুন্গ্রাহী",
    "আল আলী(العلى) – উচ্চ মর্যাদাশীল",
    "আল কাবিইর(الكبير) – সুমহান",
    "আল হাফীজ(الحفيظ) – সংরক্ষণকারী",
    "আল মুক্বিত(المقيت) – সকলের জীবনোপকরণ দানকারী",
    "আল হাসিব(الحسيب) – হিসাব গ্রহণকারী",
    "আল জলীল(الجليل)- পরম মর্যাদার অধিকারী",
    "আল কারীম(الكريم) – সুমহান দাতা",
    "আল রাক্বীব(الرقيب) – তত্ত্বাবধায়ক",
    "আল মুজীব(المجيب) – কবুলকারী",
    "আল ওয়াসি(الواسع) – সর্বত্ত বিরাজমান",
    "আল হাকীম(الحكيم) – পরম প্রজ্ঞাময়",
    "আল ওয়াদুদ(الودود) – (বান্দাদের প্রতি) সদয়",
    "আল মাজীদ(المجيد) – সকল মর্যাদার অধিকারী",
    "আল বাইস(الباعث) – পুনরুজ্জীবিতকারী",
    "আশ শাহীদ(الشهيد) – সর্বজ্ঞ স্বাক্ষী",
    "আল হাক্ব(الحق) – পরম সত্য",
    "আল ওয়াকিল(الوكيل) – পরম নির্ভরযোগ্য কর্ম-সম্পাদনকারী",
    "আল ক্বাউইউ(القوى) – পরম শক্তির অধিকারী",
    "আল মাতীন(المتين) – সুদৃঢ়",
    "আল ওয়ালীইউ(الولى) – অভিভাবক ও সাহায্যকারী",
    "আল হামীদ(الحميد) – সকল প্রশংসার অধিকারী",
    "আল মুহসি(المحصى) – সকল সৃষ্টির ব্যাপারে অবগত",
    "আল মুব্দি(المبدئ) – প্রথমবার সৃষ্টিকর্তা",
    "আল মুঈদ(المعيد) – পুনরায় সৃষ্টিকর্তা",
    "আল মুহয়ি(المحيى) – জীবন দানকারী",
    "আল মুমীত(المميت) – মৃত্যু দানকারী",
    "আল হাইয়্যু(الحي) – চিরঞ্জীব",
    "আল ক্বাইয়ূম(القيوم) – সমস্ত কিছুর ধারক ও সংরক্ষণকারী",
    "আল ওয়াজীদ(الواجد) – অফুরন্ত ভান্ডারের অধিকারী",
    "আল মাজীদ(الماجد) – শ্রেষ্ঠত্বের অধিকারী",
    "আল ওয়া’হিদ(الواحد) – এক ও অদ্বিতীয়",
    "আল আহাদ(الاحد) – এক",
    "আস সামাদ(الصمد) – অমুখাপেক্ষি",
    "আল ক্বাদীর(القادر) – সর্বশক্তিমান",
    "আল মুক্তাদির(المقتدر) – নিরঙ্কুশ সিদ্ধান্তের অধিকারী",
    "আল মুক্বদ্দিম(المقدم) – অগ্রসারক",
    "আল মুয়াক্ষীর(المؤخر) – অবকাশ দানকারী",
    "আল আউয়াল(الأول) – অনাদি",
    "আল আখির(الأخر) – অনন্ত, সর্বশেষ",
    "আল জাহির(الظاهر) – সম্পূর্ণরূপে প্রকাশিত",
    "আল বাত্বিন(الباطن) – দৃষ্টি হতে অদৃশ্য",
    "আল ওয়ালী(الوالي) – সমস্ত কিছুর অভিভাবক",
    "আল মুতা’আলী(المتعالي) – সৃষ্টির গুণাবলীর উর্দ্ধে",
    "আল বার্(البر) – পরম উপকারী",
    "আত তাওয়াব(التواب) – তাওবার তৌফিক দানকারী ও কবুলকারী",
    "আল মুনতাক্বীম(المنتقم) – প্রতিশোধ গ্রহণকারী",
    "আল আফঊ(العفو) – পরম উদার",
    "আর রউফ(الرؤوف) – পরম স্নেহশীল",
    "মালিকুল মূলক(مالك الملك) – সমগ্র জগতের বাদশাহ",
    "যুল জালালী ওয়াল ইকরাম(ذو الجلال و الإكرام) – মহিমান্বিত ও দয়াবান সত্তা",
    "আল মুক্বসিত(المقسط) – হকদারের হোক আদায়কারী",
    "আল জামিই(الجامع) – একত্রকারী, সমবেতকারী",
    "আল গানি(الغنى) – অমুখাপেক্ষি ধনী",
    "আল মুগনিই(المغنى) – পরম অভাবমোচনকারী",
    "আল মানিই(المانع) – অকল্যাণরোধক",
    "আয্ যর(الضار) – ক্ষতিসাধনকারী",
    "আন নাফিই’(النافع) – কল্যাণকারী",
    "আন নূর(النور) – পরম আলো",
    "আল হাদী(الهادي) – পথ প্রদর্শক",
    "আল বাদীই(البديع) – অতুলনীয়",
    "আল বাক্বী(الباقي) – চিরস্থায়ী, অবিনশ্বর",
    "আল ওয়ারিস(الوارث) – উত্তরাধিকারী",
    "আর রাশীদ(الرشيد) – সঠিক পথ প্রদর্শক",
    "আস সাবুর(الصبور) – অত্যাধিক ধর্য্য ধারণকারী",
  ];
}
